Simulation_code/saltConcentration_3D/0/cCation
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      ciCation;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 -3 0 0 1 0 0 ];

internalField   uniform 1;

boundaryField
{
    elecCharge
    {
        type            zeroIonicFlux;
        value           uniform 1;       
    }
   
    elecNeutral
    {
        type            zeroIonicFlux;
        value           uniform 1;      
    }
    
    Sides
    {
	type            zeroIonicFlux;
	value		uniform 1;     
    }
    
}

// ************************************************************************* //
