Simulation_code/saltConcentration_3D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-9;

vertices
(

   (-50 -50 -145) //0
   (50 -50 -145) //1
   (50 50 -145) //2
   (-50 50 -145) //3
   (-50 -50 0) //4
   (50 -50 0) //5
   (50 50 0) //6
   (-50 50 0) //7
   (-50 -50 145) //8
   (50 -50 145) //9
   (50 50 145) //10
   (-50 50 145) //11


);

blocks
(
    hex (0 1 2 3 4 5 6 7) B0 (1 1 50) simpleGrading (1 1 10)
    hex ( 4 5 6 7 8 9 10 11) B1 (1 1 50) simpleGrading (1 1 0.1)
);

edges
(
);

boundary
(
    elecCharge
    {
      type patch;
      faces
      (
            (0 3 2 1)   
      );
    }
    elecNeutral
    {
      type patch;
      faces
      (
            (8 9 10 11)   
        );
    }
    Sides
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (3 7 6 2)
            (2 6 5 1)
            (1 5 4 0)
	    (4 8 11 7)
	    (7 11 10 6)
	    (6 10 9 5)
	    (5 9 8 4)             
        );
    }
);

mergePatchPairs
(
);
// ************************************************************************* //
