Simulation_code/saltConcentration_3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    elecCharge
    {
        type            patch;
        nFaces          1;
        startFace       99;
    }
    elecNeutral
    {
        type            patch;
        nFaces          1;
        startFace       100;
    }
    Sides
    {
        type            wall;
        nFaces          400;
        startFace       101;
    }
)


// ************************************************************************* //
