Simulation_code/saltConcentration_3D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|phiE|psi|U)"
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.;
        smoother        DIC;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
    }

    "(C|ci)"
    {

        solver          BICCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }
 
}

PostProcessing
{

functions
 (
 );
 
}

electricControls
{
  nIterPNP         2;
  
  phiEEqn
   {
      residuals 1e-7;
      maxIter      1;
   }

  psiEqn
   {
      residuals 1e-7;
      maxIter      1;
   }
   
   ciEqn
   {
      residuals 1e-7;
      maxIter      1;
   }
}

SIMPLE
{
    solveFluid      true;
     
    nInIter         1;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
       
    }
}

relaxationFactors
{
    fields
     {        
	p 	1;
     }

    equations
     { 
       U 	1;
       C	1;
       ci       1;
     }
}

// ************************************************************************* //
